//#####################################################
//# ::Project  : Test
//# ::Admin    : Korei (@korei-xlix)
//# ::github   : https://github.com/korei-xlix/website/
//# ::Class    : テストクラス
//#####################################################

//#####################################################
class CLS_TestMain {
//#####################################################

//#####################################################
//# テスト
//#####################################################
	static sTest({
		inTest =top.DEF_CLD_NULL
	})
	{
		console.log( "CLS_TestMain :: " + String(inTest) ) ;
		return ;
	}



///////////////////////////////////////////////////////
//  
///////////////////////////////////////////////////////



//#####################################################
}



//#####################################################
//# グローバル定数・変数  テストクラス用
//#####################################################

//###########################
//# テストデータ
function gSTR_T_MainInfo_Str()
{
	this.TextMain				= top.DEF_GVAL_NULL ;			//テキスト me write
	this.TextSub				= top.DEF_GVAL_NULL ;			//テキスト you write
}
var gSTR_T_MainInfo = new gSTR_T_MainInfo_Str() ;

//#####################################################
//# クラス 外部参照用オブジェクト
//#####################################################

var gCLS_T			= new CLS_TestMain() ;
	this.gCLS_T		= this.gCLS_T.constructor ;



